kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
/* DC Control Globals */
volatile uint16_t vnd_dc_fast_frames = 0;   /* Countdown for fast calibration mode */

/* Public status for LCD */
volatile uint8_t  vnd_sync_mode_public = VND_SYNC_MODE_SLAVE;
volatile uint8_t  vnd_sync_ok_public = 1u;
static volatile uint8_t  vnd_sync_mode_host_forced = 0u;

void vnd_sync_on_edge(void)
{
    vnd_sync_last_capture_ms = HAL_GetTick();
    vnd_sync_ok_public = 1u;
}

/* TX диагностика */
static volatile uint8_t  vnd_tx_ready = 1;      /* готовность к новой передаче */
static volatile uint16_t vnd_last_tx_len = 0;   /* длина последней передачи */
static volatile uint32_t vnd_last_tx_start_ms = 0; /* время начала последней передачи */
/* Резерв: последний отправленный буфер (для fallback классификации при проблемах с meta-FIFO) */
static volatile uint8_t  last_tx_is_frame = 0;
static volatile uint8_t  last_tx_flags = 0;     /* 0x01=A, 0x02=B, 0x80=TEST */
static volatile uint32_t last_tx_seq = 0;
/* Простой «истинный» маркер текущей передачи (в полёте) — не зависит от очереди метаданных */
static volatile uint8_t  inflight_is_frame = 0;
static volatile uint8_t  inflight_flags = 0; /* 0x01/0x02/0x80 */
static volatile uint32_t inflight_seq = 0;
/* Режим полноценный/диагностический */
static volatile uint8_t full_mode = 1;          /* 1 = слать рабочие ADC кадры, 0 = только тест/статус */
static volatile uint64_t vnd_total_tx_bytes = 0ULL;
/* Ограничение выборок (0 = без ограничения -> берём полный буфер профиля) */
static volatile uint16_t vnd_trunc_samples = 0;
/* Параметры кадровой частоты */
static volatile uint16_t vnd_frame_samples_req = 0; /* если 0 — вычислять по умолчанию под ~20 FPS */
static volatile uint16_t vnd_pair_period_ms = 50;   /* целевой период пары A+B в миллисекундах */
static volatile uint32_t vnd_next_pair_ms = 0;      /* следующий момент разрешения отправки A новой пары */
/* Флаг: первая полноценная пара (A->B) завершена. До этого STAT между парами стараемся не слать. */
static volatile uint8_t first_pair_done = 0;
/* Базовая отметка суммарных байт на момент START для вычисления дельты к STOP */
static volatile uint64_t vnd_tx_bytes_at_start = 0ULL;
/* Флаг для продолжения передачи из main/таска после TXCPLT */
volatile uint8_t vnd_tx_kick = 0;

/* Асинхронный режим передачи: 0 = строгие пары A->B (по умолчанию), 1 = A/B независимы */
static volatile uint8_t async_mode = 0;
/* Флаг: хост явно задавал async_mode через SET_ASYNC_MODE.
    Нужен, чтобы START не перетирал настройку и можно было включать парный/ROI режим. */
static volatile uint8_t async_mode_host_set = 0;
/* Режим каналов: 0=A-only, 1=B-only, 2=both (default) */
static volatile uint8_t vnd_ch_mode = 2;

/* Дефолтный размер кадра в полном режиме (семплов на канал) */
#ifndef VND_FULL_DEFAULT_SAMPLES
#define VND_FULL_DEFAULT_SAMPLES 300
#endif

/* Тестовый режим: генерация пилообразного сигнала вместо реальных данных ADC */
#define USE_TEST_SAWTOOTH 0 /* Отключаем полную замену пайплайна тестовым источником */
/* Новый мягкий режим: подменяем полезную нагрузку на пилу, но сохраняем ADC/DMA и async. */
#ifndef TEST_OVERLAY_SAWTOOTH
#define TEST_OVERLAY_SAWTOOTH 0  /* DISABLED: Testing real ADC data with forced EXTSEL/EXTEN */
#endif
/* реализация генератора тестового сигнала вынесена в vnd_testgen.* */
/* Разрешение на отправку STAT в стриме: 0=запрещено, 1=разрешён один STAT */
volatile uint8_t vnd_status_permit_once = 0;
/* Отложенная отправка тестового кадра после ACK-STAT */
static volatile uint8_t test_pending = 0;
/* Управление стартовым STAT (ACK на START) и единоразовым тестом */
static volatile uint8_t start_stat_planned = 0;   /* устаревший флаг, не используем для новой логики */
static volatile uint8_t start_stat_inflight = 0;  /* Стартовый STAT начат, ждём его завершения */
/* Флаг «ACK на START завершён» — разрешает единовременную отправку тестового кадра из таска */
static volatile uint8_t start_ack_done = 0;
/* Новые флаги пошаговой последовательности */
static volatile uint8_t status_ack_pending = 0;   /* Нужно отправить ACK-STAT на START (только из таска) */
static volatile uint8_t stop_request = 0;         /* Запрошен STOP (нужно отправить STAT, затем остановить) */
static volatile uint8_t stop_stat_inflight = 0;   /* Сейчас в полёте STAT как ACK на STOP */
/* Диагностика подготовки пар */
static volatile uint32_t dbg_prepare_calls = 0;
static volatile uint32_t dbg_prepare_ok = 0;
static volatile uint32_t dbg_task_calls = 0; /* сколько раз заходили в Vendor_Stream_Task */
/* Счётчик пропущенных кадров (last-buffer-wins): сколько кадров FIFO было перескочено */
static volatile uint32_t dbg_skipped_frames = 0;

/* Состояния передачи пары */
static uint8_t channel0_sent_curseq = 0;
static uint8_t channel1_sent_curseq = 0;
static uint32_t __attribute__((unused)) last_sent_seq_adc0 = 0xFFFFFFFFu;
static uint32_t __attribute__((unused)) last_sent_seq_adc1 = 0xFFFFFFFFu;

/* Буфер статуса */
#ifndef VND_STATUS_MAX
#define VND_STATUS_MAX 96 /* v1=64B, v2=76B, v3=84B, v4=96B (добавлены ADC тайминги) */
#endif
static uint8_t status_buf[VND_STATUS_MAX];
static vnd_status_v1_t g_status;
static volatile uint8_t pending_status = 0; /* требуется отправить STAT при освобождении EP */
/* Новые этапы (stage) времени старта потока/интерфейса */
volatile uint32_t vnd_stage_alt1_ms = 0;      /* фиксируется при SET_INTERFACE alt=1 */
volatile uint32_t vnd_stage_first_frame_ms = 0; /* фиксируется при первом успешном TXCPLT A/B */

/* Состояние фейковых кадров */
static __attribute__((unused)) uint8_t fake_inflight = 0;   /* reserved for diag */
static uint8_t diag_mode_active = 0; /* 1 = слать диагностические пары постоянно */
static uint16_t diag_hz = 60;        /* частота кадров-пар, Гц (20..100) (информативно) */
static uint32_t diag_period_ms = 0;  /* не используется для темпирования (макс. скорость) */
static uint32_t diag_next_ms = 0;    /* не используется для темпирования (сохранено для совместимости) */
static uint16_t diag_samples = VND_DEFAULT_TEST_SAMPLES; /* сэмплов на канал в диагностическом режиме */
static uint16_t diag_frame_len = 0;  /* общий размер кадра (hdr+payload) в диагностике */
/* Буферы диагностических кадров A/B (живут до завершения передачи) */
static uint8_t diag_a_buf[VND_FRAME_MAX_SIZE];
static uint8_t diag_b_buf[VND_FRAME_MAX_SIZE];
/* Последовательно подготовленная пара для текущего stream_seq в DIAG: */
static uint32_t diag_prepared_seq = 0xFFFFFFFFu;
static uint32_t diag_current_pair_seq = 0xFFFFFFFFu;
static uint16_t win_start0 = 0, win_len0 = 0, win_start1 = 0, win_len1 = 0;
static uint8_t win_auto = 1; /* авто-окно для ROI (зависит от частоты) */

#ifndef VND_ROI_LEN_DEFAULT
#define VND_ROI_LEN_DEFAULT 200u
#endif
#ifndef VND_ROI_BASE_START_200HZ
#define VND_ROI_BASE_START_200HZ 300u
#endif
#ifndef VND_ROI_BASE_MARKER_HZ
#define VND_ROI_BASE_MARKER_HZ 200u
#endif

static uint16_t vnd_compute_auto_roi_start(uint16_t samples, uint16_t marker_hz)
{
    int32_t delta = (int32_t)marker_hz - (int32_t)VND_ROI_BASE_MARKER_HZ;
    int32_t start = (int32_t)VND_ROI_BASE_START_200HZ + delta;
    int32_t max_start = (int32_t)samples - (int32_t)VND_ROI_LEN_DEFAULT;
    if (max_start < 0) max_start = 0;
    if (start < 0) start = 0;
    if (start > max_start) start = max_start;
    return (uint16_t)start;
}

static void vnd_apply_auto_roi_window(void)
{
    uint16_t samples = adc_stream_get_active_samples();
    if (samples == 0u) samples = 600u;
    uint16_t buf_rate = adc_stream_get_buf_rate();
    uint16_t marker_hz = (buf_rate != 0u) ? (uint16_t)(buf_rate / 2u) : (uint16_t)VND_ROI_BASE_MARKER_HZ;
    uint16_t new_start = vnd_compute_auto_roi_start(samples, marker_hz);
    win_len0 = VND_ROI_LEN_DEFAULT;
    win_start0 = new_start;
    win_start1 = 0u;
    win_len1 = 0u;
}

/* Текущий режим стриминга (по умолчанию оставляем текущий "последний буфер") */
static volatile uint8_t vnd_stream_mode = VND_STREAM_MODE_LATEST;

/* stream_mode=2: усреднение ROI по N буферам, раздельно для even/odd. */
static volatile uint8_t vnd_avg_n = 20; /* 1..64 (рекомендуемые значения: 8/16/24/32/40/48/56/64) */
static uint8_t vnd_avg_cnt[2] = {0,0};
static uint8_t vnd_avg_next_parity = 0; /* 0=even, 1=odd (legacy; не используется для выпуска кадров) */
static uint32_t vnd_avg_last_dma_seq[2] = {0,0};
static uint32_t vnd_avg_last_ts_ms[2] = {0,0};
static uint32_t vnd_avg_sum[2][2][MAX_FRAME_SAMPLES]; /* [parity][ch][i] */
static __attribute__((unused)) uint16_t vnd_avg_out[2][MAX_FRAME_SAMPLES];    /* [ch][i] */

/* Диагностика stream_mode=2: сколько входных кадров съели / сколько усреднённых выпустили */
static volatile uint32_t dbg_avg_in_frames = 0;
static volatile uint32_t dbg_avg_out_frames = 0;
static volatile uint32_t dbg_avg_tx_pairs = 0;
static uint32_t dbg_avg_last_print_ms = 0;
static uint32_t dbg_avg_in_last = 0, dbg_avg_out_last = 0, dbg_avg_tx_last = 0;

/* DC: параметры */
#ifndef VND_DC_ROI_LEN
#define VND_DC_ROI_LEN 200u
#endif
#ifndef VND_DC_RANGE_THRESHOLD
#define VND_DC_RANGE_THRESHOLD ((uint32_t)(65535u * 90u / 100u)) /* 90% полной шкалы */
#endif

/* Шаг просмотра при оценке размаха (mx-mn) на сыром буфере.
    Для низкочастотного сигнала можно ставить 4, чтобы уменьшить нагрузку CPU.
    1 = проверять каждый семпл (самое надёжное). */
#ifndef VND_DC_RANGE_STRIDE
#define VND_DC_RANGE_STRIDE 4u
#endif
#ifndef VND_DC_SAVE_PERIOD_MS
#define VND_DC_SAVE_PERIOD_MS (20u*60u*1000u) /* 20 минут (стандартный режим) */
#endif
#ifndef VND_DC_SAVE_PERIOD_FIRST_MS
#define VND_DC_SAVE_PERIOD_FIRST_MS (60u*1000u) /* 60 секунд: быстрое первое сохранение после reboot */
#endif

/* После загрузки DC из Flash первые кадры могут быть нестабильны (старт ADC/аналоговой части).
    Чтобы не «переписать» только что восстановленное состояние, временно блокируем адаптацию,
    но продолжаем ПРИМЕНЯТЬ DC сразу. */
#ifndef VND_DC_ADAPT_HOLDOFF_MS
#define VND_DC_ADAPT_HOLDOFF_MS (2000u)
#endif

/* Быстрая поиндексная (per-sample) подстройка DC.
    Важно: DC хранится как 4 массива по 200 значений (канал×чет/нечет), и корректировка
    должна быть по каждому семплу, а не только одним числом.
    Эти параметры задают «скорость» поиндексной адаптации и ограничение шага. */
#ifndef VND_DC_SAMPLE_GAIN_DIV
/* Поиндексная адаптация: шаг ~= err/div. Меньше div -> быстрее.
    Важно: это НЕ «общий» шаг для всего окна, а индивидуально для каждого i. */
#define VND_DC_SAMPLE_GAIN_DIV (256)
#endif
#ifndef VND_DC_SAMPLE_STEP_MAX
/* Скорость по просьбе: шаг адаптации ±1 на один вызов. */
#define VND_DC_SAMPLE_STEP_MAX (1)
#endif

