kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
/* Deadband для адаптации DC вокруг midscale.
    Без deadband даже при правильном DC из-за шума знак (v-32767) будет часто меняться,
    что приводит к "random walk" (постоянно dirty и ощущение, что после reboot всё заново).
    Значение в LSB. */
#ifndef VND_DC_DEADBAND
#define VND_DC_DEADBAND 16u
#endif

/* ВНИМАНИЕ: адрес Flash должен быть вне области прошивки.
   Мы резервируем последний сектор через линкер (см. STM32H723VGTX_FLASH.ld).
   Для 1MB FLASH: база последнего сектора = 0x080E0000 (128KB сектор №7). */
#ifndef VND_DC_FLASH_ADDR
#define VND_DC_FLASH_ADDR 0x080E0000u
#endif

#define VND_DC_MAGIC 0x31434456u /* 'V''D''C''1' little-endian */
/* ver=2: dc[] стало int16_t (signed offsets), совместимость с ver=1 не поддерживаем */
#define VND_DC_VER   2u

typedef struct __attribute__((packed)) {
    uint32_t magic;
    uint16_t ver;
    uint16_t roi_len; /* ожидаем 200 */
    uint32_t write_counter;
    uint16_t crc16; /* CRC16-CCITT по полю data[] */
    uint16_t _rsv0;

    int16_t  dc[2][2][VND_DC_ROI_LEN]; /* [ch][parity][i] signed offset */
    uint8_t  pos[2][2];
    uint8_t  _pad[32]; /* запас/выравнивание; точный размер не критичен */
} vnd_dc_blob_t;

/* Flash layout: append-only journal inside the reserved 128KB sector.
   This avoids long sector erase on every save (which can stall USB/main loop).
   We erase the sector only when it becomes full or journal tail is corrupted.
   Slot size must be multiple of 32 bytes for FLASHWORD programming. */
#define VND_DC_FLASH_SECTOR_SIZE (0x20000u)
#define VND_DC_SLOT_SIZE         (((uint32_t)sizeof(vnd_dc_blob_t) + 31u) & ~31u)

static int16_t  vnd_dc_buf[2][2][VND_DC_ROI_LEN];
static uint8_t  vnd_dc_pos[2][2];
static uint8_t  vnd_dc_loaded = 0;
static uint8_t  vnd_dc_dirty = 0;
static uint32_t vnd_dc_write_counter = 0;
static uint32_t vnd_dc_flash_next_off = 0;
static uint32_t vnd_dc_last_save_ms = 0;
static uint32_t vnd_dc_last_dirty_log_ms = 0;
static volatile uint8_t vnd_dc_load_request = 0;

/* После reboot "чет/нечет" (parity) может оказаться инвертирован относительно того, что было
    во время обучения/сохранения (из-за фазировки старта DMA/TIM).
    Мы НЕ смешиваем 4 DC массива, а один раз на старте определяем swap (0/1) и дальше
    используем parity^swap при применении/адаптации. */
static uint8_t vnd_dc_parity_swap = 0;
static uint8_t vnd_dc_parity_swap_valid = 0;

static void vnd_dc_load_once(void);
static void vnd_dc_apply_and_adapt(uint8_t ch, uint8_t parity, uint16_t *out, uint16_t roi_len, uint8_t gate_enabled);

/* Exported counters for LCD/diagnostics (see usb_vendor_app.h) */
volatile uint32_t vnd_dc_save_ok_count = 0;
volatile uint32_t vnd_dc_save_fail_count = 0;
volatile uint32_t vnd_dc_save_last_ms = 0;
volatile uint8_t  vnd_dc_save_last_result = 0; /* 0=none, 1=ok, 2=fail */

/* DC Adaptation control (can be frozen by host during signal detection) */
volatile uint8_t  vnd_dc_adapt_enabled = 1; /* 1=active (learning), 0=freeze (keep current values) */

/* Auto-freeze when signal swing is below threshold (no DC save/progress) */
volatile uint8_t  vnd_dc_auto_freeze = 0; /* 1=auto-freeze by amplitude gate */

/* Public mirror of blob write_counter for LCD/debug (see usb_vendor_app.h) */
volatile uint32_t vnd_dc_write_counter_public = 0;

/* Exported live state for LCD progress indicator */
volatile uint8_t  vnd_dc_dirty_public = 0;
volatile uint32_t vnd_dc_dirty_since_ms = 0;
volatile uint32_t vnd_dc_save_period_ms = (uint32_t)VND_DC_SAVE_PERIOD_MS;

/* DC save diagnostics */
volatile uint32_t vnd_dc_save_last_err = 0;
volatile uint32_t vnd_dc_save_last_sector_error = 0;
volatile uint32_t vnd_dc_save_last_bank = 0;
volatile uint32_t vnd_dc_save_last_sector = 0;

/* DC load diagnostics (published for LCD) */
volatile uint8_t  vnd_dc_load_flags_public = 0; /* bit0=loaded OK, bit1=erase_pending */
volatile uint16_t vnd_dc_loaded_crc16_public = 0;
volatile uint32_t vnd_dc_flash_next_off_public = 0;

static uint32_t vnd_dc_adapt_block_until_ms = 0;

/* Гейт DC для текущей группы усреднения (решение принимается по полному сырому буферу до 600 семплов).
    1 = DC включён (если на полном буфере есть полный размах > threshold), 0 = DC выключен. */
/* DC gate больше не привязан к stream_mode: он вычисляется в фоне по сырому буферу (mx-mn).
    stream_mode влияет только на то, что отправляется по USB. */

static uint16_t vnd_crc16_ccitt(const uint8_t *data, uint32_t len); /* объявлена ниже в файле */

/* === TIM5 sync helpers (32-bit phase counter) === */
__attribute__((unused))
static uint32_t vnd_tim5_get_tim_clk(void)
{
    uint32_t pclk1 = HAL_RCC_GetPCLK1Freq();
    uint32_t ppre1 = (RCC->D2CFGR & RCC_D2CFGR_D2PPRE1) >> RCC_D2CFGR_D2PPRE1_Pos;
    return ((ppre1 & 0x4u) != 0u) ? (pclk1 * 2u) : pclk1;
}

__attribute__((unused))
static void vnd_sync_stop_tim5(void)
{
    (void)HAL_TIM_Base_Stop(&htim5);
}

__attribute__((unused))
static void vnd_sync_start_tim5_base(void)
{
    (void)HAL_TIM_Base_Start(&htim5);
}

static void vnd_sync_set_master(uint16_t buf_rate_hz)
{
    /* TIM5 теперь используется как 32-битный счётчик фазы, не как генератор синхроимпульсов */
    (void)buf_rate_hz;
    vnd_sync_last_hz = buf_rate_hz;
}

static void vnd_sync_set_slave(void)
{
    /* TIM5 как 32-битный счётчик фазы: запускается базовым таймером в main.c */
    vnd_sync_capture_valid = 0;
}

static void vnd_sync_apply_mode(uint8_t mode)
{
    extern volatile uint8_t g_arr_manual_mode;

    if(mode > VND_SYNC_MODE_OFF) mode = VND_SYNC_MODE_MASTER;

    if (mode == VND_SYNC_MODE_MASTER || mode == VND_SYNC_MODE_SLAVE) {
        adc_stream_clear_buf_rate_override();
    }

    vnd_sync_mode = mode;
    {
        extern volatile uint8_t sync_edge_seen;
        extern volatile uint32_t sync_last_edge_ms;
        extern TIM_HandleTypeDef htim5;
        extern volatile uint8_t sync_align_pending;
        extern volatile uint8_t sync_phase_lock_armed;
        extern volatile uint8_t sync_phase_lock_active;
        extern volatile uint8_t sync_restart_on_edge;
        sync_edge_seen = 0u;
        sync_last_edge_ms = 0u;
        htim5.Instance->CNT = 0u;
        sync_align_pending = 0u;
        sync_phase_lock_armed = 0u;
        sync_phase_lock_active = 0u;
        sync_restart_on_edge = 0u;
    }
    if(mode == VND_SYNC_MODE_MASTER){
        vnd_sync_mode_public = VND_SYNC_MODE_MASTER;
        vnd_sync_set_master(0u);
        vnd_sync_ok_public = 1u;
    } else if(mode == VND_SYNC_MODE_SLAVE){
        extern volatile uint8_t sync_align_pending;
        extern volatile uint8_t sync_phase_lock_armed;
        extern volatile uint8_t sync_restart_on_edge;
        vnd_sync_mode_public = VND_SYNC_MODE_SLAVE;
        vnd_sync_set_slave();
        vnd_sync_ok_public = 0u;
        vnd_sync_start_tim5_base();
        if (g_arr_manual_mode) {
            sync_align_pending = 0u;
            sync_phase_lock_armed = 0u;
            sync_restart_on_edge = 0u;
        } else {
            sync_align_pending = 1u;
            sync_phase_lock_armed = 1u;
            sync_restart_on_edge = 1u;
        }
    } else {
        vnd_sync_mode_public = VND_SYNC_MODE_OFF;
        vnd_sync_ok_public = 0u;
    }
    vnd_sync_pending_hz = 0u;
    vnd_sync_last_capture_ms = 0u;
    vnd_sync_last_apply_ms = 0u;
    HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);
    vnd_adc_restart_request = 1u;
    cdc_logf("EVT SYNC_MODE APPLY mode=%u", (unsigned)mode);
}

void vnd_sync_set_mode_auto(uint8_t mode)
{
    if (vnd_sync_mode_host_forced) {
        return;
    }
    vnd_sync_apply_mode(mode);
}

/* Принудительная установка режима (не блокируется флагом host_forced) */
void vnd_sync_apply_mode_forced(uint8_t mode)
{
    vnd_sync_mode_host_forced = 1u;
    vnd_sync_apply_mode(mode);
}

