kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
/* Снятие принудительного режима, возврат к автоматическому */
void vnd_sync_release_host_forced(void)
{
    vnd_sync_mode_host_forced = 0u;
}

uint8_t vnd_sync_is_mode_host_forced(void)
{
    return vnd_sync_mode_host_forced;
}

__attribute__((unused))
static uint16_t vnd_dc_bank_crc16(uint8_t ch, uint8_t parity)
{
    if(ch > 1u || parity > 1u) return 0;
    return vnd_crc16_ccitt((const uint8_t*)vnd_dc_buf[ch][parity], (uint32_t)sizeof(vnd_dc_buf[ch][parity]));
}

static uint32_t vnd_dc_score_bank(const uint16_t *raw, uint16_t raw_ns, uint16_t roi_start, uint16_t roi_len, uint8_t ch, uint8_t parity)
{
    if(!raw) return 0xFFFFFFFFu;
    if(ch > 1u || parity > 1u) return 0xFFFFFFFFu;
    if(roi_len != (uint16_t)VND_DC_ROI_LEN) return 0xFFFFFFFFu;
    if(raw_ns < (uint16_t)(roi_start + roi_len)) return 0xFFFFFFFFu;

    /* Скоринг: весь ROI (200 точек). Это выполняется редко (один раз после reboot),
       поэтому лучше быть надёжным, чем быстрым. */
    uint32_t acc = 0;
    for(uint16_t i = 0; i < roi_len; i++){
        uint16_t v = raw[roi_start + i];
        int16_t dc = vnd_dc_buf[ch][parity][i];
        int32_t y = (int32_t)v + (int32_t)dc;
        int32_t e = y - 32767;
        if(e < 0) e = -e;
        acc += (uint32_t)e;
    }
    return acc;
}

static inline void vnd_invalidate_dcache_range(uint32_t addr, uint32_t len)
{
#if (VND_ENABLE_CACHE_INVALIDATE && (__DCACHE_PRESENT == 1U))
    if(len == 0u) return;
    uint32_t a0 = addr & ~31u;
    uint32_t a1 = (addr + len + 31u) & ~31u;
    uint32_t alen = a1 - a0;
    SCB_InvalidateDCache_by_Addr((uint32_t*)a0, (int32_t)alen);
#else
    (void)addr; (void)len;
#endif
}

static inline uint8_t vnd_raw_has_full_swing_u16(const uint16_t *p, uint16_t n, uint32_t threshold)
{
    if(!p || n == 0u) return 0u;
    uint16_t mn = 0xFFFFu;
    uint16_t mx = 0u;

    uint16_t step = (uint16_t)VND_DC_RANGE_STRIDE;
    if(step == 0u) step = 1u;

    for(uint16_t i=0;i<n;i=(uint16_t)(i+step)){
        uint16_t v = p[i];
        if(v < mn) mn = v;
        if(v > mx) mx = v;
        if((uint32_t)(mx - mn) > threshold) return 1u; /* экономим CPU: дальше не проверяем */
    }
    return 0u;
}

/* Background DC maintenance (always-on, independent of stream_mode).
   Uses raw ADC latest FIFO frame (peek) to decide gate (mx-mn > threshold) and then applies+adapts DC on ROI.
   NOTE: threshold is swing (max-min), not absolute level.
   IMPORTANT: uses peek API so it does NOT consume FIFO frames used for USB streaming. */
static void vnd_dc_background_step(uint16_t roi_start, uint16_t roi_len)
{
    /* Обязательно загрузить DC из Flash как можно раньше после reboot,
       даже если окно пока не выставлено в 200. */
    vnd_dc_load_once();
    if(roi_len == 0u) return;
    if(roi_len != (uint16_t)VND_DC_ROI_LEN) return;

    /* Не чаще 50 Гц, и не повторно на том же кадре */
    static uint32_t last_run_ms = 0;
    static uint32_t last_seq = 0xFFFFFFFFu;
    uint32_t now_ms = HAL_GetTick();
    if((now_ms - last_run_ms) < 20u) return;
    last_run_ms = now_ms;

    uint16_t *a_ptr = NULL, *b_ptr = NULL; uint16_t ns = 0; uint32_t dma_seq = 0;
    if(!adc_peek_latest_frame_pair_fifo(&a_ptr, &b_ptr, &ns, &dma_seq)){
        return;
    }
    if(dma_seq == last_seq) return;
    last_seq = dma_seq;
    if(!a_ptr || !b_ptr) return;
    if(ns < (uint16_t)(roi_start + roi_len)){
        return;
    }

    uint8_t parity = (uint8_t)(adc_get_buffer_parity(dma_seq) & 1u);
    uint16_t check_n = ns;
    if(check_n > 600u) check_n = 600u;

    uint8_t gate_a = vnd_raw_has_full_swing_u16(a_ptr, check_n, (uint32_t)VND_DC_RANGE_THRESHOLD);
    uint8_t gate_b = vnd_raw_has_full_swing_u16(b_ptr, check_n, (uint32_t)VND_DC_RANGE_THRESHOLD);

    /* Auto-freeze DC save/progress when signal swing is below threshold (both channels). */
    {
        static uint8_t  prev_freeze = 0u;
        static uint32_t freeze_start_ms = 0u;
        uint8_t now_freeze = (uint8_t)((gate_a || gate_b) ? 0u : 1u);

        if(now_freeze){
            if(!prev_freeze){
                freeze_start_ms = now_ms;
            }
        } else {
            if(prev_freeze && freeze_start_ms != 0u){
                if(vnd_dc_dirty_since_ms != 0u){
                    uint32_t delta = now_ms - freeze_start_ms;
                    vnd_dc_dirty_since_ms += delta; /* pause progress timer during freeze */
                }
                freeze_start_ms = 0u;
            }
        }
        prev_freeze = now_freeze;
        vnd_dc_auto_freeze = now_freeze;
    }

    /* Use local copy of ROI so we don't mutate ADC buffers. */
    static uint16_t tmp_a[VND_DC_ROI_LEN];
    static uint16_t tmp_b[VND_DC_ROI_LEN];
    memcpy(tmp_a, a_ptr + roi_start, (size_t)roi_len * sizeof(uint16_t));
    memcpy(tmp_b, b_ptr + roi_start, (size_t)roi_len * sizeof(uint16_t));

    /* Диагностика согласования с GUI: раз в секунду печатаем min/max/mean по ROI
       до и после применения DC (для тех же данных). */
    static uint32_t last_stats_ms = 0;
    uint8_t do_stats = 0u;
    if(last_stats_ms == 0u || (now_ms - last_stats_ms) >= 1000u){
        last_stats_ms = now_ms;
        do_stats = 1u;
    }
    uint16_t raw_mn_a = 0xFFFFu, raw_mx_a = 0u;
    uint16_t raw_mn_b = 0xFFFFu, raw_mx_b = 0u;
    __attribute__((unused)) int32_t raw_mean_a = 0;
    __attribute__((unused)) int32_t raw_mean_b = 0;
    if(do_stats){
        int64_t sum_a = 0;
        int64_t sum_b = 0;
        for(uint16_t i = 0; i < roi_len; i++){
            uint16_t va = tmp_a[i];
            uint16_t vb = tmp_b[i];
            if(va < raw_mn_a) raw_mn_a = va;
            if(va > raw_mx_a) raw_mx_a = va;
            if(vb < raw_mn_b) raw_mn_b = vb;
            if(vb > raw_mx_b) raw_mx_b = vb;
            sum_a += (int32_t)va;
            sum_b += (int32_t)vb;
        }
        raw_mean_a = (int32_t)(sum_a / (int32_t)roi_len);
        raw_mean_b = (int32_t)(sum_b / (int32_t)roi_len);
    }

    /* Ensure persisted DC is loaded before first adapt. */
    vnd_dc_load_once();

