kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    if(!gate_enabled){
        return; /* адаптация выключена */
    }

    /* Проверяем флаг управления адаптацией от хоста (CMD_SET_DC_ADAPT).
       Если 0 (FREEZE) - только вычитаем DC, но не обучаемся (не меняем vnd_dc_buf). */
    if(!vnd_dc_adapt_enabled){
        return; /* адаптация заморожена хостом */
    }

    /* На старте после reboot/load применяем DC, но не учимся некоторое время,
       чтобы «первый мусорный кадр» не уводил DC в промежуточное состояние. */
    {
        uint32_t now_ms = HAL_GetTick();
        if(vnd_dc_adapt_block_until_ms != 0u && now_ms < vnd_dc_adapt_block_until_ms){
            return;
        }
    }

     /* 2) Адаптация DC: строго поиндексная (per-sample).
         Никаких «общих» шагов по среднему на весь банк: обновляем каждый dc[i] отдельно,
         по ошибке конкретного семпла out[i] относительно 32767.
         Модель: out = raw + dc[i]; если out[i] слишком велик -> dc[i] делаем более отрицательным. */
    int64_t sum = 0;
    for(uint16_t i=0;i<roi_len;i++) sum += (int32_t)out[i];
    int32_t mean = (int32_t)(sum / (int32_t)roi_len);
    __attribute__((unused)) int32_t err = mean - 32767;

    int32_t dead = (int32_t)VND_DC_DEADBAND;
    if(dead < 0) dead = 0;

    uint8_t changed = 0;
    /* per-sample correction */
    {
        int32_t div = (int32_t)VND_DC_SAMPLE_GAIN_DIV;
        int32_t smax = (int32_t)VND_DC_SAMPLE_STEP_MAX;
        
        /* FAST CALIBRATION MODE override with Annealing */
        if (vnd_dc_fast_frames > 0) {
             div = 1;       // Max gain (1 error -> 1 correction)
             
             // Dynamic step size (Annealing) to reduce noise capture at the end
             // User requested sequence: 128 -> 64 -> 32 ... -> 1
             if (vnd_dc_fast_frames > 80)      smax = 256; // Very fast start
             else if (vnd_dc_fast_frames > 60) smax = 64;
             else if (vnd_dc_fast_frames > 40) smax = 16;
             else if (vnd_dc_fast_frames > 20) smax = 4;
             else                              smax = 1;   // Final polish
             
             // Decrement counter once per pair (at channel 1)
             if (ch == 1) {
                 vnd_dc_fast_frames--;
             }
        }
        
        if(div <= 0) div = 1;
        if(smax < 1) smax = 1;
        if(smax > 64 && vnd_dc_fast_frames == 0) smax = 64; /* cap only if not fast calib */

        for(uint16_t i=0;i<roi_len;i++){
            int32_t e = (int32_t)out[i] - 32767;
            if(e > -dead && e < dead) continue;

            int32_t step_i = e / div;
            if(step_i == 0) step_i = (e > 0) ? 1 : -1;
            if(step_i > smax) step_i = smax;
            if(step_i < -smax) step_i = -smax;

            int32_t v = (int32_t)vnd_dc_buf[ch][p][i];
            v -= step_i;
            if(v < -32768) v = -32768;
            else if(v > 32767) v = 32767;
            int16_t nv = (int16_t)v;
            if(nv != vnd_dc_buf[ch][p][i]){
                vnd_dc_buf[ch][p][i] = nv;
                changed = 1;
            }
        }
    }

    if(changed){
        if(!vnd_dc_dirty){
            uint32_t now_ms = HAL_GetTick();
            vnd_dc_dirty_since_ms = now_ms;
        }
        /* ограничим частоту DIRTY лога */
        {
            uint32_t now_ms = HAL_GetTick();
            if(vnd_dc_last_dirty_log_ms == 0u || (now_ms - vnd_dc_last_dirty_log_ms) > 1000u){
                vnd_dc_last_dirty_log_ms = now_ms;
                   VND_DC_LOGF("[DC] DIRTY: ch=%u p=%u mean=%ld err=%ld step=per-sample(max=%ld)\r\n",
                       (unsigned)ch, (unsigned)p,
                      (long)mean, (long)err, (long)(int32_t)VND_DC_SAMPLE_STEP_MAX);
            }
        }
        vnd_dc_dirty = 1;
        vnd_dc_dirty_public = 1;
    }
}

static void vnd_dc_load_once(void)
{
    if(vnd_dc_loaded) return;
    vnd_dc_loaded = 1;

    /* Scan journal once after reset: find last valid record + compute next write offset.
       If tail is corrupted (non-empty but invalid), mark sector as "needs erase" for next save. */
    const uint8_t *base = (const uint8_t *)(uintptr_t)VND_DC_FLASH_ADDR;
    const vnd_dc_blob_t *best = NULL;
    uint32_t best_cnt = 0;
    uint32_t next_off = 0;
    uint8_t need_erase = 0;

    for(uint32_t off = 0; (off + (uint32_t)sizeof(vnd_dc_blob_t)) <= VND_DC_FLASH_SECTOR_SIZE; off += VND_DC_SLOT_SIZE){
        const vnd_dc_blob_t *b = (const vnd_dc_blob_t *)(const void *)(base + off);
        if(b->magic == 0xFFFFFFFFu){
            next_off = off;
            break;
        }
        if(b->magic != VND_DC_MAGIC || b->ver != (uint16_t)VND_DC_VER || b->roi_len != (uint16_t)VND_DC_ROI_LEN){
            next_off = off;
            need_erase = 1;
            break;
        }
        uint32_t data_off = (uint32_t)offsetof(vnd_dc_blob_t, dc);
        uint32_t data_len = (uint32_t)sizeof(b->dc) + (uint32_t)sizeof(b->pos);
        uint16_t crc = vnd_crc16_ccitt(((const uint8_t*)b) + data_off, data_len);
        if(crc != b->crc16){
            next_off = off;
            need_erase = 1;
            break;
        }
        if(best == NULL || b->write_counter >= best_cnt){
            best = b;
            best_cnt = b->write_counter;
        }
        next_off = off + VND_DC_SLOT_SIZE;
    }

    if(next_off > (VND_DC_FLASH_SECTOR_SIZE - VND_DC_SLOT_SIZE)){
        /* Full sector */
        need_erase = 1;
    }
    vnd_dc_flash_next_off = need_erase ? VND_DC_FLASH_SECTOR_SIZE : next_off;
    vnd_dc_flash_next_off_public = vnd_dc_flash_next_off;

    if(best == NULL){
        VND_DC_LOGF("[DC] LOAD EMPTY (journal)\r\n");
        memset(vnd_dc_buf, 0, sizeof(vnd_dc_buf));
        memset(vnd_dc_pos, 0, sizeof(vnd_dc_pos));
        vnd_dc_adapt_block_until_ms = HAL_GetTick() + (uint32_t)VND_DC_ADAPT_HOLDOFF_MS;
        vnd_dc_dirty = 0;
        vnd_dc_dirty_public = 0;
        vnd_dc_dirty_since_ms = 0;
        vnd_dc_write_counter = 0;
        vnd_dc_write_counter_public = 0;
        vnd_dc_load_flags_public = 0;
        vnd_dc_loaded_crc16_public = 0;
        vnd_dc_last_save_ms = HAL_GetTick();
        return;
    }

    memcpy(vnd_dc_buf, best->dc, sizeof(vnd_dc_buf));
    memcpy(vnd_dc_pos, best->pos, sizeof(vnd_dc_pos));
    vnd_dc_parity_swap_valid = 0u; /* пересчитаем после загрузки на первом кадре */
    vnd_dc_write_counter = best->write_counter;
    vnd_dc_write_counter_public = vnd_dc_write_counter;
    vnd_dc_load_flags_public = (uint8_t)(1u | (need_erase ? 2u : 0u));
    vnd_dc_loaded_crc16_public = best->crc16;
    vnd_dc_dirty = 0;
    vnd_dc_dirty_public = 0;
    vnd_dc_dirty_since_ms = 0;
    vnd_dc_adapt_block_until_ms = HAL_GetTick() + (uint32_t)VND_DC_ADAPT_HOLDOFF_MS;
    vnd_dc_last_save_ms = HAL_GetTick();
        VND_DC_LOGF("[DC] LOAD OK (journal): cnt=%lu next_off=%lu%s\r\n",
           (unsigned long)vnd_dc_write_counter,
           (unsigned long)vnd_dc_flash_next_off,
           need_erase ? " ERASE_PENDING" : "");

        VND_DC_LOGF("[DC] ADAPT_HOLDOFF: %lu ms\r\n", (unsigned long)(uint32_t)VND_DC_ADAPT_HOLDOFF_MS);

        /* Печатаем контрольные суммы 4 массивов DC (канал×parity), чтобы руками сравнить до/после reboot. */
        VND_DC_LOGF("[DC] BANK CRC16: A0=%04X A1=%04X B0=%04X B1=%04X\r\n",
            (unsigned)vnd_dc_bank_crc16(0u,0u), (unsigned)vnd_dc_bank_crc16(0u,1u),
            (unsigned)vnd_dc_bank_crc16(1u,0u), (unsigned)vnd_dc_bank_crc16(1u,1u));
}

static void vnd_dc_try_save_periodic(void)
{
    if(vnd_dc_auto_freeze) return; /* auto-freeze: no saving while signal below threshold */
    /* Привязываем период к моменту, когда DC стал dirty (и к LCD-прогрессу).
       Это устраняет ситуацию, когда прогресс дошёл до конца, а попытка save не делается.
       Условие: если dirty и прошло >= period с dirty_since_ms — пытаемся писать.
       При FAIL: НЕ очищаем dirty, но перезапускаем отсчёт (следующая попытка через period).
       При OK: очищаем dirty и сбрасываем dirty_since_ms.
     */
    if(!vnd_dc_dirty_public) return;
    if(!vnd_dc_dirty) return;
    uint32_t now = HAL_GetTick();
    uint32_t period = (vnd_dc_write_counter == 0u)
                      ? (uint32_t)VND_DC_SAVE_PERIOD_FIRST_MS
                      : (uint32_t)VND_DC_SAVE_PERIOD_MS;
    vnd_dc_save_period_ms = period;
    if(period == 0u) period = 1u;
    if(vnd_dc_dirty_since_ms == 0u){
        vnd_dc_dirty_since_ms = now;
        return;
    }
    if((now - vnd_dc_dirty_since_ms) < period) return;

    vnd_dc_blob_t blob;
    memset(&blob, 0, sizeof(blob));
    blob.magic = VND_DC_MAGIC;
    blob.ver = (uint16_t)VND_DC_VER;
    blob.roi_len = (uint16_t)VND_DC_ROI_LEN;
    blob.write_counter = ++vnd_dc_write_counter;
    vnd_dc_write_counter_public = vnd_dc_write_counter;
    memcpy(blob.dc, vnd_dc_buf, sizeof(vnd_dc_buf));
    memcpy(blob.pos, vnd_dc_pos, sizeof(vnd_dc_pos));
    uint32_t data_off = (uint32_t)offsetof(vnd_dc_blob_t, dc);
    uint32_t data_len = (uint32_t)sizeof(blob.dc) + (uint32_t)sizeof(blob.pos);
    blob.crc16 = vnd_crc16_ccitt(((const uint8_t*)&blob) + data_off, data_len);

     /* Диагностика: контрольные суммы 4 DC массивов в RAM на момент сохранения.
         Это позволяет сравнить с тем, что загрузится после reboot. */
    VND_DC_LOGF("[DC] SAVE BANK CRC16: A0=%04X A1=%04X B0=%04X B1=%04X\r\n",
              (unsigned)vnd_dc_bank_crc16(0u,0u), (unsigned)vnd_dc_bank_crc16(0u,1u),
              (unsigned)vnd_dc_bank_crc16(1u,0u), (unsigned)vnd_dc_bank_crc16(1u,1u));

    /* Запись во Flash: journal append. Стираем сектор ТОЛЬКО когда он заполнится/повреждён. */
    HAL_FLASH_Unlock();
    /* HAL версии отличаются по именам флагов ошибок. */
#if defined(FLASH_FLAG_ALL_ERRORS)
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS);
#elif defined(FLASH_FLAG_ALL_ERRORS_BANK1)
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS_BANK1);
    #if defined(FLASH_FLAG_ALL_ERRORS_BANK2)
        __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS_BANK2);
    #endif
#else
    /* Fallback: ничего не чистим явно */
#endif

            /* Определяем bank/sector по адресу (STM32H723, 1MB FLASH, 128KB sectors).
               В этом проекте DC хранится в 0x080E0000..0x080FFFFF, это ГЛОБАЛЬНЫЙ сектор #7.
               Устройство dual-bank: Bank1 содержит сектора 0..3, Bank2 содержит сектора 4..7. */
            uint32_t erase_bank = FLASH_BANK_1;
            uint32_t erase_sector = 0;
            {
                uint32_t addr = (uint32_t)VND_DC_FLASH_ADDR;
                uint32_t rel = addr - 0x08000000u;
                uint32_t sec_global = rel / 0x20000u; /* 128KB */
                if(sec_global > 7u) sec_global = 7u;

            #if defined(FLASH_BANK_2)
                if(sec_global >= 4u) erase_bank = FLASH_BANK_2;
            #endif

            #if defined(FLASH_SECTOR_0)
                erase_sector = (uint32_t)FLASH_SECTOR_0 + sec_global;
            #else
                erase_sector = sec_global;
            #endif
            }

    /* Сохраним, что именно использовали (для LCD/диагностики) */
    vnd_dc_save_last_bank = erase_bank;
    vnd_dc_save_last_sector = erase_sector;
    vnd_dc_save_last_sector_error = 0;
    vnd_dc_save_last_err = 0;

    /* Determine write offset. If sector is full/corrupted, erase once and restart from 0. */
    uint32_t write_off = vnd_dc_flash_next_off;
    if(write_off > (VND_DC_FLASH_SECTOR_SIZE - VND_DC_SLOT_SIZE)){
        FLASH_EraseInitTypeDef e;
        uint32_t sector_error = 0;
        memset(&e, 0, sizeof(e));
        e.TypeErase = FLASH_TYPEERASE_SECTORS;
        e.Banks = erase_bank;
        e.Sector = erase_sector;
        e.NbSectors = 1;
        if(HAL_FLASHEx_Erase(&e, &sector_error) != HAL_OK){
            uint32_t err = 0;
#if defined(HAL_FLASH_GetError)
            err = HAL_FLASH_GetError();
#endif
            vnd_dc_save_last_err = err;
            vnd_dc_save_last_sector_error = sector_error;
            vnd_dc_save_fail_count++;
            vnd_dc_save_last_result = 2;
            vnd_dc_save_last_ms = now;
                 VND_DC_LOGF("[DC] SAVE FAIL: erase(full) bank=%lu sector=%lu err=0x%08lX sec_err=%lu\r\n",
                   (unsigned long)erase_bank, (unsigned long)erase_sector, (unsigned long)err, (unsigned long)sector_error);
            HAL_FLASH_Lock();
            /* Не сбрасываем dirty. Перезапускаем отсчёт до следующей попытки. */
            vnd_dc_dirty_since_ms = now;
            return;
        }
        write_off = 0;
        vnd_dc_flash_next_off = 0;
    }

