kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    /* v3 расширение: ДИАГНОСТИКА счётчиков нулевых буферов ADC */
    g_status.ch_zero_buffers_A = d.ch_zero_buffers[0];
    g_status.ch_zero_buffers_B = d.ch_zero_buffers[1];
    /* v4 расширение: текущий tick и метки последнего полного DMA кадра по каналам */
    do {
        uint32_t now_ms = HAL_GetTick();
        extern volatile uint32_t adc_last_full0_ms;
        extern volatile uint32_t adc_last_full1_ms;
        g_status.now_ms = now_ms;
        g_status.last_full0_ms = adc_last_full0_ms;
        g_status.last_full1_ms = adc_last_full1_ms;
        if (streaming &&
            (vnd_last_host_rx_ack_ms != 0u) &&
            ((uint32_t)(now_ms - vnd_last_host_rx_ack_ms) <= VND_HOST_RX_ACK_TIMEOUT_MS)) {
            g_status.flags_runtime |= VND_STFLAG_HOST_RX_ALIVE;
        }
    } while(0);
     /* Хак: инкремент dbg_skipped_frames отображаем в sent0/sent1 дельтах, но здесь добавим только
        косвенную диагностику: если skips растут, host увидит разницу produced_seq - sent*. Дополнительно
        можно временно печатать в CDC при отладке (сейчас лог выключен для скорости). */
    /* Выход: если буфер маленький (например EP0 64B) — отдадим только v1-часть и версию=1 */
    if(max_len < sizeof(vnd_status_v1_t)){
        g_status.version = 1;
        memcpy(dst, &g_status, 64);
        return 64;
    }
    memcpy(dst,&g_status,sizeof(g_status));
    return (uint16_t)sizeof(g_status);
}

uint8_t vnd_is_streaming(void){ return streaming; }
uint8_t vnd_is_tx_enabled(void){ return vnd_tx_enable; }

static void vnd_apply_tx_enable_outputs(void)
{
    if(vnd_tx_enable){
        /* Разрешаем внешний передатчик; PA2 продолжает жить своей стриминговой логикой. */
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_RESET);
    } else {
        /* Запрещённый TX должен удерживать оба физических вывода передачи в LOW. */
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_RESET);
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_7, GPIO_PIN_RESET);
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_SET);
        HAL_GPIO_WritePin(SYNC_OUT_GPIO_Port, SYNC_OUT_Pin, GPIO_PIN_RESET);
    }
}

/* функция vnd_generate_test_sawtooth() реализована в vnd_testgen.c */

static void vnd_prepare_pair(void)
{
    uint32_t t_start = get_us_approx(); /* Начало измерения */

    dbg_prepare_calls++;
    /* ВАЖНО: полный режим (non-async) отправляет/закрывает пары по pair_send_idx.
       Чтобы не зависать, готовим пару именно в том слоте, который будет отправляться следующим.
       Иначе можно заполнить другой слот и затем бесконечно ждать READY в pair_send_idx. */
    uint8_t active_slot = pair_send_idx;
    if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
        /* В строгих режимах не готовим пары "вперёд" в других слотах.
           Иначе при оборачивании кольца можно накопить READY-кадры вне pair_send_idx
           и получить зависание/перестановку A/B. */
        if(g_frames[active_slot][0].st != FB_FILL || g_frames[active_slot][1].st != FB_FILL){
            return;
        }
    } else {
        for(uint8_t i=0;i<VND_PAIR_BUFFERS;i++){
            uint8_t s = (uint8_t)((pair_send_idx + i) % VND_PAIR_BUFFERS);
            if(g_frames[s][0].st == FB_FILL && g_frames[s][1].st == FB_FILL){ active_slot = s; break; }
        }
    }
    
    /* Убран подробный лог PREPARE_PAIR — счётчики агрегируются в периодическую статистику */
    uint16_t *ch1 = NULL, *ch2 = NULL; uint16_t samples = 0;
    (void)ch1; (void)ch2; /* могут быть неиспользованы в режиме overlay */
    uint16_t crc_a = 0; uint32_t crc_seq = 0;
    uint32_t pair_seq = 0;
    uint8_t used_avg_q = 0;
    uint8_t used_avg_q_idx = 0;
    uint32_t used_avg_ts_ms = 0;
    /* Локальный снапшот staging-буфера, чтобы TC не перезаписал usb_stage_bufA во время копирования */
    static __attribute__((unused)) uint16_t stage_copy[MAX_FRAME_SAMPLES];
    uint16_t stage_samples = 0;
    (void)stage_samples; /* может быть неиспользован при ADC_USB_STAGE_ENABLE=0 */
    
#if USE_TEST_SAWTOOTH
    /* Тестовый режим: используем последнюю сгенерированную пару буферов */
    {
        /* Генерируем свежий буфер-пилу (1..N) перед выборкой */
        vnd_generate_test_sawtooth();
        uint16_t *tb0 = NULL, *tb1 = NULL; uint16_t avail = 0;
        if(!vnd_testgen_try_consume_latest(&tb0, &tb1, &avail)){
            return; /* нет новых данных */
        }
        ch1 = tb0; ch2 = tb1;
        samples = (avail != 0) ? avail : 302;  /* МАРКЕР #2 - fallback если avail=0 */
        (void)ch1; (void)ch2; /* используем в тестовом режиме, чтобы подавить предупреждения */
        (void)stage_samples; (void)seq; (void)static_mode; (void)static_seq;
        static uint32_t test_seq = 0; pair_seq = ++test_seq;
        /* Зафиксировать размер кадра, если ещё не задан, чтобы отправка не зависела от профиля АЦП */
        if(cur_samples_per_frame == 0){
            uint16_t eff = samples;
            if(eff > VND_MAX_SAMPLES) eff = VND_MAX_SAMPLES;
            cur_samples_per_frame = eff;
            cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + (uint32_t)eff * 2u);
        }
    }
#else
        /* Два режима:
             0) LATEST (как сейчас): "последний заполненный буфер", пропуски допустимы.
                 1) LOSSLESS_ROI: строго по FIFO (без пропусков на стороне прошивки), но отправляем только окно ROI.
                         Окно задаётся win_start0/win_len0; по умолчанию 280..480 (200) и сдвигается по частоте. */
    if (vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI)
    {
        /* ROI окно */
        uint16_t roi_start = win_start0;
        uint16_t roi_len   = win_len0;
        if(roi_len == 0u){
            roi_len = VND_ROI_LEN_DEFAULT;
            if(win_auto){
                vnd_apply_auto_roi_window();
                roi_start = win_start0;
            } else {
                roi_start = 0u;
            }
        }
        if(roi_len > VND_MAX_SAMPLES) roi_len = VND_MAX_SAMPLES;
        if(roi_len > MAX_FRAME_SAMPLES) roi_len = MAX_FRAME_SAMPLES;

        if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI)
        {
            /* Берём следующий кадр строго по очереди (A+B синхронно по DMA seq) */
            if(!adc_peek_frame_pair_fifo(&ch1, &ch2, &samples, &pair_seq)){
                return;
            }
            if(samples < (uint16_t)(roi_start + roi_len)){
                /* Профиль/размер кадра не подходит под ROI — ждём корректного кадра */
                (void)adc_consume_frame_pair_fifo(pair_seq);
                return;
            }
            /* Лочим формат кадра на ROI длину */
            if(cur_samples_per_frame != roi_len){
                cur_samples_per_frame = roi_len;
                cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + (uint32_t)cur_samples_per_frame * 2u);
            }
            /* Смещаем указатели на начало ROI (FIFO-блоки стабильно хранят данные по seq). */
            ch1 = ch1 + roi_start;
            ch2 = ch2 + roi_start;
            /* В ROI режиме не используем precomputed CRC из staging (оно было для полного кадра). */
            crc_a = 0; crc_seq = 0;
            samples = cur_samples_per_frame;
        }
        else
        {
            /* stream_mode=2: выдаём только готовые усреднённые ROI кадры из очереди.
               Сбор/усреднение идёт в фоне через vnd_avg_drain_fifo(), чтобы не терять входные кадры. */
            if(vnd_avg_q_count == 0){
                return;
            }
            used_avg_q = 1;
            used_avg_q_idx = vnd_avg_q_head;

            /* Инициализируем формат кадра по ROI длине */
            if(cur_samples_per_frame != roi_len){
                cur_samples_per_frame = roi_len;
                cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + (uint32_t)cur_samples_per_frame * 2u);
            }

