kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    /* ACK-STAT на START: отключено, чтобы не занимать Vendor IN перед первой парой.
       Хост может опрашивать состояние через GET_STATUS (EP0). */
    if(status_ack_pending){ start_ack_done = 1; status_ack_pending = 0; }

    uint32_t now = HAL_GetTick();
    /* Fallback: если ACK так и не ушёл в полёт (status_ack_pending держится),
       не ждём бесконечно — считаем ACK выполненным и продолжаем к TEST. */
    if(!test_sent && !start_ack_done && status_ack_pending){
        if(now - start_cmd_ms > 200){
            start_ack_done = 1; status_ack_pending = 0;
            vnd_ep_busy = 0; vnd_tx_ready = 1;
            extern void USBD_VND_ForceTxIdle(void); USBD_VND_ForceTxIdle();
            VND_LOG("ACK_FALLBACK(no inflight) -> allow TEST");
            if(!vnd_ep_busy){ vnd_try_send_test_from_task(); }
        }
    }

    if(!test_sent && start_stat_inflight) {
        if(now - vnd_last_tx_start_ms > 80) {
            /* На некоторых хостах ACK-STAT может не завершиться DataIn/ZLP. Разблокируем вручную. */
            start_stat_inflight = 0; start_ack_done = 1; vnd_ep_busy = 0; vnd_tx_ready = 1;
            extern void USBD_VND_ForceTxIdle(void); USBD_VND_ForceTxIdle();
            VND_LOG("ACK_TIMEOUT -> unlock test");
            /* Сразу отдадим ещё один STAT (если был queued) и попробуем отправить TEST */
            if(pending_status && !vnd_ep_busy){
                vnd_try_send_pending_status_from_task();
            }
            if(!vnd_ep_busy){
#if !VND_DISABLE_TEST
                vnd_try_send_test_from_task();
#endif
            }
        }
    }
    /* Аварийный обход: если тест не ушёл за разумное время после START — считаем его выполненным и продолжаем */
    if(!test_sent && (now - start_cmd_ms) > 160) {
        test_in_flight = 0;
        test_sent = 1;
        start_ack_done = 1;
        VND_LOG("TEST_FALLTHRU after %lums -> proceed to A/B", (unsigned long)(now - start_cmd_ms));
    }

    /* ASYNC MODE: используем только vnd_async_try_tx() (без legacy prepare_pair/pump).
       Иначе старый парный путь может потреблять/копировать ADC и перегружать CPU/логи,
       что приводит к остановке/редким кадрам на хосте после первых нескольких фреймов. */
#if !USE_TEST_SAWTOOTH
    if(async_mode && full_mode && !diag_mode_active){
        if(!vnd_ep_busy){ (void)vnd_async_try_tx(); }
        if(vnd_tick_flag) vnd_tick_flag = 0;
        vnd_cdc_periodic_stats(now);
        return;
    }
#endif
    vnd_align_strict_pair_cursor();
    /* ВАЖНО: сначала попробуем подготовить пару A/B, чтобы не зациклиться на ранних STAT.
       Подготовка пары не зависит от занятости EP, поэтому убираем лишний гейтинг по vnd_ep_busy. */
    {
        ChanFrame *fA0 = &g_frames[pair_send_idx][0];
        if(fA0->st != FB_READY){ vnd_prepare_pair(); }
    }
    /* Раннее окно для GET_STATUS до первой пары — отключено: STAT по IN только между парами. */
    /* Подавляем TEST в фазе pending_init: сосредоточиться на ускорении первой A пары */
    if(vnd_pending_init){
        /* Быстрый init-pump: до 200 мс после START каждые ~2 мс пробуем подготовить и отправить A
           Расширено: используем текущий pair_fill_idx вместо жёсткого [0], добавлен ранний STAT и ослабленный fresh gating. */
        static uint32_t last_pump_ms = 0;
        extern volatile uint32_t frame_wr_seq;
        static uint32_t start_wr_seq_snapshot = 0; /* первый wr_seq на момент START */
        if(start_wr_seq_snapshot == 0){ start_wr_seq_snapshot = frame_wr_seq; }
        if(start_cmd_ms && (now - start_cmd_ms) < 200){
            if(now - last_pump_ms > 2){
                last_pump_ms = now;
                init_pump_attempts++;
                ChanFrame *fAfill = &g_frames[pair_send_idx][0];
                if(fAfill->st != FB_READY){ vnd_prepare_pair(); fAfill = &g_frames[pair_send_idx][0]; }
                     /* Ранний relax: первые 20 мс достаточно одного инкремента wr_seq, далее требуем +2.
                         Доп. послабление: после 100 мс позволяем отправить первую A даже без прироста wr_seq
                         (на случай, если ADC успел подготовить кадр, но счётчик ещё не вырос). */
                 uint32_t age_ms = now - start_cmd_ms;
                 #if USE_TEST_SAWTOOTH
                     uint8_t fresh_ok = 1u; /* в тестовом режиме не ждём рост wr_seq от ADC/DMA */
                 #else
                     uint8_t fresh_ok = (age_ms < 20) ? (frame_wr_seq > start_wr_seq_snapshot ? 1u : 0u)
                                                        : (frame_wr_seq > start_wr_seq_snapshot + 1 ? 1u : 0u);
                 #endif
                /* Защитная инициализация размера кадра если ADC уже дал конфигурацию, но SIZE_LOCK не прошёл */
                if(cur_samples_per_frame == 0 && age_ms > 25){
                    uint16_t prof_s = adc_stream_get_active_samples();
                    uint16_t eff_s = prof_s;
                    if(vnd_frame_samples_req && vnd_frame_samples_req < eff_s) eff_s = vnd_frame_samples_req;
                    if(vnd_trunc_samples && vnd_trunc_samples < eff_s) eff_s = vnd_trunc_samples;
                    if(eff_s > VND_MAX_SAMPLES) eff_s = VND_MAX_SAMPLES;
                    if(eff_s){
                        cur_samples_per_frame = eff_s;
                        cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + (uint32_t)cur_samples_per_frame*2u);
                    }
                }
                /* Ещё один страховочный замок: после 60 мс если размер всё ещё 0 — попробуем взять текущий active_samples и вывести диагностику */
                if(cur_samples_per_frame == 0 && age_ms == 60){
                    uint16_t prof_s2 = adc_stream_get_active_samples();
                    uint16_t eff_s2 = prof_s2;
                    if(vnd_frame_samples_req && vnd_frame_samples_req < eff_s2) eff_s2 = vnd_frame_samples_req;
                    if(vnd_trunc_samples && vnd_trunc_samples < eff_s2) eff_s2 = vnd_trunc_samples;
                    if(eff_s2 > VND_MAX_SAMPLES) eff_s2 = VND_MAX_SAMPLES;
                    if(eff_s2){
                        cur_samples_per_frame = eff_s2;
                        cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + (uint32_t)cur_samples_per_frame*2u);
                    }
                    cdc_logf("INIT_DBG age=%lu wr=%lu fA_st=%u cur_s=%u ep_busy=%u",
                             (unsigned long)age_ms, (unsigned long)frame_wr_seq, (unsigned)fAfill->st,
                             (unsigned)cur_samples_per_frame, (unsigned)vnd_ep_busy);
                }
                /* Разрешаем первую A, если кадр готов и либо fresh_ok, либо прошло уже >100 мс (fallback) */
                if(fAfill->st == FB_READY && (fresh_ok || age_ms > 100) && !vnd_ep_busy){
                    if(!vnd_strict_slot_ready_for_stream(pair_send_idx)){ if(vnd_tick_flag) vnd_tick_flag = 0; return; }
                    if(vnd_transmit_frame(fAfill->buf, fAfill->frame_size, 0, 0, "ADC0-PUMP") == USBD_OK){
                        fAfill->st = FB_SENDING; sending_channel = 0;
                        pending_B = (vnd_ch_mode == 0)?0:1; if(pending_B) pending_B_since_ms = HAL_GetTick(); else pending_B_since_ms = 0;
                        vnd_pending_init = 0; vnd_stream_active = 1; init_pump_a_sent++;
                        VND_LOG("INIT_PUMP_A queued size=%u wr_seq=%lu age=%lums fresh=%u", (unsigned)fAfill->frame_size, (unsigned long)frame_wr_seq, (unsigned long)age_ms, (unsigned)fresh_ok);
                        /* После первой A выходим из init-pump */
                    }
                }
            }
        }
    } else {
        /* Старое окно отправки TEST переносим сюда (вне pending_init), если TEST разрешён */
        if(!test_sent && !test_in_flight){
            if(!vnd_ep_busy && (now - start_cmd_ms) > 50){
#if !VND_DISABLE_TEST
                vnd_try_send_test_from_task();
#endif
                if(vnd_ep_busy){ if(vnd_tick_flag) vnd_tick_flag = 0; return; }
            }
        }
    }
    /* CRITICAL WATCHDOG: Если TxCplt не пришёл > 500ms, принудительно сбрасываем inflight.
       Причина: на Windows хост может "забыть" забрать данные или ZLP не отправился.
       Без этого устройство зависает с vnd_inflight=1 навсегда. */
    if(vnd_stream_mode == VND_STREAM_MODE_LATEST && vnd_inflight){
        uint32_t dt_ms = (now >= vnd_last_tx_start_ms) ? (now - vnd_last_tx_start_ms) : (0xFFFFFFFFu - vnd_last_tx_start_ms + 1u + now);
        if(dt_ms > 500){
            VND_LOG("WATCHDOG: vnd_inflight stuck for %lums, force reset", (unsigned long)dt_ms);
        cdc_logf("!!! WATCHDOG: TX stuck, force reset (dt=%lu ms)", (unsigned long)dt_ms);
        vnd_inflight = 0;
        vnd_ep_busy = 0;
        vnd_tx_ready = 1;
        sending_channel = 0xFF;
        /* Пытаемся восстановить передачу */
            vnd_tx_kick = 1;
        }
    }
    if((vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI) &&
       vnd_inflight && vnd_last_tx_start_ms != 0 && sending_channel == 0 && pending_B){
        uint32_t dt_ms = (now >= vnd_last_tx_start_ms) ? (now - vnd_last_tx_start_ms) : (0xFFFFFFFFu - vnd_last_tx_start_ms + 1u + now);
        if(dt_ms > 1200){
            uint8_t wd_slot = vnd_get_active_stream_slot(pending_B ? 1u : 0u);
            ChanFrame *wdA = &g_frames[wd_slot][0];
            extern uint8_t USBD_VND_TxIsBusy(void);
            uint8_t ll_busy = USBD_VND_TxIsBusy();
            if(ll_busy){
                goto lossless_a_wd_done;
            }
            extern void USBD_VND_ForceTxIdle(void); USBD_VND_ForceTxIdle();
            vnd_inflight = 0;
            vnd_ep_busy = 0;
            vnd_tx_ready = 1;
            if(wdA->st == FB_SENDING){
                vnd_meta_neutralize(0x01, wdA->seq);
                wdA->st = FB_FILL;
            }
            sending_channel = 0xFF;
            if(vnd_ch_mode != 0){
                pending_B = 1;
                if(pending_B_since_ms == 0){ pending_B_since_ms = now; }
            }
            pair_send_idx = wd_slot;
            vnd_tx_kick = 1;
            VND_LOG("LOSSLESS_A_WD dt=%lums seq=%lu slot=%u", (unsigned long)dt_ms, (unsigned long)wdA->seq, (unsigned)wd_slot);
        }
    }
lossless_a_wd_done:
    
    if(test_in_flight && (now - vnd_last_tx_start_ms) > 100){
        /* На некоторых хостах (FS/RPi) DataIn может не вызваться после короткого TEST.
           Чтобы не зависнуть с занятым EP, снимаем busy и продолжаем. */
    test_in_flight = 0;
    test_sent = 1;
    vnd_ep_busy = 0;
    vnd_tx_ready = 1;
    extern void USBD_VND_ForceTxIdle(void); USBD_VND_ForceTxIdle();
        vnd_tx_kick = 1;
        VND_LOG("TEST_TIMEOUT -> unlock EP");
    }
    if(!test_sent && !vnd_pending_init){
        if(!vnd_ep_busy){
#if !VND_DISABLE_TEST
            vnd_try_send_test_from_task();
#endif
        }
        /* Не выходим раньше времени: позволим подготовку/отправку A/B идти параллельно. */
    }

